02_OpenFOAM_FVM/cases/Ejercicio4/Parte1_FVM/OneDScalar_5celdas_u25/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    // Ejercicio 4 Parte 1: 5 celdas segun enunciado
    hex (0 1 2 3 4 5 6 7) (5 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    out
    {
        type patch;
        faces
        (
            (1 2 6 5)
       
        );
	
    }
    in
    {
        type patch;
        faces
        (
       
            (0 4 7 3)
        );

    }
    emptywalls
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
